export const data = [
  {
    upperTitle: "💰 Доставка безкоштовна?",
    lowerTitle: `Доставка є Безкоштовною. Мінімальна сума доставки складає 150 або
        250 грн, в залежності від адреси доставки.`,
  },
  {
    upperTitle: "💳 Чи можлива оплата карткою?",
    lowerTitle: `Так! Ви можете розрахуватися картою на сайті, або при отримані
    замовлення.`,
  },
  {
    upperTitle: "🚀 Скільки чекати на доставку?",
    lowerTitle: `Доставка в зелену зону Львова – до 59 хвилин (в період з 10:00 до
        20:00, в інший час 59 хвилин). Доставка в жовту зону – до 59 хвилин.`,
  },
  {
    upperTitle: "⏰ Який у Вас графік роботи?",
    lowerTitle: `Ми працюємо цілодобово.`,
  },
  {
    upperTitle: "🍕 В яких містах працює доставка піци LA П'ЄЦ?",
    lowerTitle: `Ми працюємо у Львові, Вінниці, Івано-Франківську, Харкові, Стрию,
    Хмельницькому, Рівному, Чернівцях, Черкасах та Дрогобичі .`,
  },
];
