import React, { useState } from "react";
import "./DrinkHideText.css";

function DrinkHideText() {
  const [text, setText] = useState(true);

  const [toggle, setToggle] = useState(false);

  const abc = () => {
    setToggle(!toggle);
    setText(!text);
  };

  return (
    <div className="DrinkHideText">
      <div className="dht-content">
        <div className={toggle ? "hide-content show" : "hide-content"}>
          <p className="dht-title">Замовити напої до піци</p>
          <div className="dht-after-title">
            <p>
              Для того, щоб сповна відчути смак страви, бажано вдало підібрати
              напої. Піца не є виключенням, хоч вона і стала предметом суперечок
              серед гурманів. Що ж пити з цією стравою? Відповідь залежатиме від
              гастрономічних вподобань людини, регіональних особливостей і
              смаків.
            </p>
            <p className="dht-title2">Напої з доставкою у Львові</p>
            <p>
              Давайте пригадаємо, як все було першочергово. Піца у звичному для
              нас вигляді з’явилася на столах знатних італійців приблизно
              наприкінці 16 століття. Без сумніву, найбільш популярним напоєм в
              Італії незмінно є вино. Жителі цієї країни вважають такий напій
              найкращим додатком до піци. Найчастіше вони подають червоне, рідше
              – біле. В якості альтернативи можна вживати звичайну чисту або ж
              мінеральну воду. Прийнято думати, що їй не під силу перебити
              істинний смак вишуканої страви.
            </p>
            <p>
              Проте за межами батьківщини піци ні вино, ні вода не стали
              популярними додатками. Наприклад, у Чехії прийнято запивати їжу
              бехеровкою. А в Америці страва давно вийшла за межі ресторанів.
              З’явилася спеціальна доставка, що зробило піцу невід’ємною
              частиною багатьох корпоративів і зустрічей із друзями. Тут вже не
              було мови про витончені бокали з вином – на зміну цьому прийшло
              пиво.
            </p>
            <p>
              В Америці користуються попитом гострі страви з салямі та іншими
              м‘ясними наповненнями. Вони дуже добре поєднуються з пивом, тому
              вибір був навіть якоюсь мірою очевидним. Воно добре підкреслює
              спеції і прянощі та робить смак страви доволі пікантним.
            </p>
            <p>
              Зараз цей напій став найбільш популярним додатком до піци у всьому
              світі, і навіть молоде покоління італійців знаходить у ньому
              більше переваг, ніж у вині. Цю традицію підтримали і німці, адже
              пиво для них є традиційним напоєм. А от у Нідерландах чи Франції
              ще дуже популярні соки та кока-кола.
            </p>
            <p>
              Такі різноманітні поєднання доступні і у нас в Україні. Доставка
              піци «Lа П’єц» у Львові пропонує за 29 хвилин доставити Вам не
              тільки гарячу ароматну піцу, спечену в кращих італійських
              традиціях, але й напої, які Ви забажаєте.
            </p>
            <p>
              Смак піци від «Lа П’єц» буде неперевершеним, адже піцерія дбає про
              те, щоб страви зберігали свої смакові якості та привабливий аромат
              якомога довше. Саме тому доставка здійснюється у спеціальних
              термосумках. Завдяки цьому піца буде на смак такою, наче її щойно
              дістали із печі. Вже кортить скуштувати? Зробіть замовлення у «Lа
              П’єц» та насолоджуйтеся свіжоспеченою піцою!
            </p>
          </div>
        </div>
        <p className="toggle" onClick={abc}>
          {text ? "Читати більше" : "Приховати"}
        </p>
      </div>
      <div className="img-absolute">
        <img
          src="https://la.ua/wp-content/themes/lapiec/assets/frontend/img/bg-city-vectro-1.png"
          alt="img"
        />
        <img
          src="https://la.ua/wp-content/themes/lapiec/assets/frontend/img/bg-city-vectro-2.png"
          alt="img"
        />
      </div>
    </div>
  );
}

export default DrinkHideText;
