import React, { useState } from "react";
import "./TextHideSalad.css";

function TextHideSalad() {
  const [open, setOpen] = useState(false);
  const [text, setText] = useState(true);

  const tgl = () => {
    setOpen(!open);
    setText(!text);
  };

  return (
    <div className="TextHide-sector">
      <div className="TextHide-container">
        <div className={open ? "TextHide-items show" : "TextHide-items"}>
          <div className="TextHide-title1">
            <p>Салати з доставкою у Львові</p>
            <p>
              Піца у традиційному вигляді існує вже близько п’яти століть, і за
              цей час вона полюбилася багатьом людям. Сьогодні страва часто
              прикрашає посиденьки з колегами чи друзями та будь-яке сімейне
              свято.
            </p>
            <p>
              Безумовно, це найвідоміша страва, яка прийшла до нас із Італії. У
              кожному регіоні країни вона має свою специфіку: римська – більш
              легка, неаполітанська – доволі калорійна, венеціанська –
              оригінальна. Мало хто замислюється над тим, із якими легкими
              закусками чи напоями поєднати піцу. Дізнайтеся, чим можна
              урізноманітнити смак та підкреслити його пікантність.
            </p>
          </div>
          <div className="TextHide-title2">
            <p>Замовити салат у LA П’ЄЦ</p>
            <p>
              Зазвичай, під час приготування піци використовуються томатні соуси
              або ж соуси для барбекю. Це вважається стандартним варіантом.
              Проте у хороших сервісах доставки, як, наприклад, «Lа П’єц», тісто
              збалансовано із соусом, щоб страва не потребувала інших додатків.
            </p>
            <p>
              Любителі гострих страв можуть додати соус табаско – він
              приготований на основі перцю чилі. Табаско вважається невід’ємною
              частиною застіль у Південній Америці. Дуже важливо витримати міру,
              щоб гострота не перебила букет ароматів і смак страви. Достатньо
              буде додати лише декілька крапель.
            </p>
          </div>
          <div className="TextHide-title3">
            <p>Смачні та вишукані</p>
            <p>
              Саме вони допоможуть Вам збалансувати соуси та начинку італійської
              страви. Чудово підійдуть салати зі свіжих овочів. Дехто звик
              заїдати піцу «Цезарем» чи «Шопським» салатом. Але це не найкращі
              варіанти, адже вони мають у своєму складі м’ясні інгредієнти, як і
              більшість піц, тому краще обрати щось більш легке.
            </p>
            <p>
              Наприклад, до піци смакуватиме грецький салат чи мікс зі свіжих
              овочів і салатного листя. Замість м’яса краще використати твердий
              сир, горіхи чи якийсь незвичний соус. Від важких салатів із
              майонезом і сметаною краще відмовитись. Краще надайте перевагу
              оливковій олії.
            </p>
            <p>
              Італійці зазвичай замовляють одну піцу на людину і салат або щось
              із розділу antipasto. Якщо піца в італійському меню значиться як
              primo, це не означає, що треба замовити десерт. Є ризик, що в
              такому випадку Ви просто не осилите таку кількість їжі.
            </p>
            <p>
              Боїтеся помилитися та обрати не той салат? Зателефонуйте до
              доставки піци «Lа П’єц» у Львові та проконсультуйтеся перед тим,
              як зробити замовлення. Вам швидко доставлять смачну піцу, щойно
              спечену у дров’яній печі. Завдяки доставці у термосумці вона не
              вистигне та збереже всі свої смакові якості. Різноманітні салати
              стануть прекрасним доповненням до страви, тож не баріться
              поласувати смаколиками – піцерія «Lа П’єц» вже готова тішити Вас
              своїми кулінарними шедеврами.
            </p>
          </div>
        </div>
        <div className="images">
          <img
            src="https://la.ua/wp-content/themes/lapiec/assets/frontend/img/bg-city-vectro-1.png"
            alt=""
          />
          <img
            src="https://la.ua/wp-content/themes/lapiec/assets/frontend/img/bg-city-vectro-2.png"
            alt=""
          />
        </div>
        <div className="toggle-button">
          <p onClick={tgl}>{text ? 'Читати більше' : 'Приховати'}</p>
        </div>
      </div>
    </div>
  );
}

export default TextHideSalad;
